[
    "Someone close to you is sick. you need to adventure to find a cure.",
    "Someone stole something important from you and you need to find it.",
    "You have received a message from a long lost relative and are trying to find them.",
    "Someone that you love has been kidnapped (maybe You have  to earn money to pay a ransom or complete some deed).",
    "Adventuring runs in the family. everyone is expected to complete one quest in their lives.",
    "Your family or culture sends people out to complete certain tasks when they reach a certain age as a rite of passage.",
    "Another character saved you in the past so you feel indebted to them and travel with them, protecting/aiding them.",
    "There's a magical drought in your hometown and You have  to fix it.",
    "Your hometown doesn't have a lot of jobs so You have  to travel and send money back home.",
    "Some childhood friends and you made a scavenger hunt where you try and complete a checklist of certain tasks (ie. defeat a barbarian in hand to hand combat, steal x amount of gold, slay a dragon, etc) in an allotted amount of time. ",
    "A god/patron has sent you on a quest to do something for them.",
    "You have been hired by someone to complete a task (and you get sucked into the big adventure along the way).",
    "You are on a quest for knowledge. maybe it is to learn the best ways of fighting, maybe it's something more academic related.",
    "Your priest received a vision from your god and they sent you on a quest.",
    "You are writing a book about the world and different cultures and you need first hand experience.",
    "You have found every map You have come across is shitty, so you decide to become a cartographer and make your own.",
    "You are a detective who helps solve crimes and need to travel to solve a particular case.",
    "You are a collector of a certain object and travel across the land to find it.",
    "You are apart of an adventuring academy and have to complete a quest to graduate.",
    "You are an artisan and you travel with your wares, trying to sell them. alternatively, You are trying to spread word of your business and gain new business partners.",
    "You worked at a tavern your whole life where an old bard would sing songs of their adventuring party and that inspired you to go and do some adventuring of your own."
]
